//-----------------------------------------
// 숫자 값(number value or literal)
//-----------------------------------------
//실수
101.21
//소수
0.871
//정수
98
//음수
-1.07

//-----------------------------------------
// 문자 값(string)
//-----------------------------------------

// 작은 따옴표(')
'2px'
// 큰 따옴표(")
//프로그램 문장이 끝날 때 마침을 의미하는 세미콜론(;)추가
"20mm";
//역따옴표(`, backtick)  
`2inch`


//-----------------------------------------
// 논리(boolean)값
//- 참 (Truthy, true)
//- 거짓 (Falsy, false)


//✅ 프로그램이 허용하는 불리언 값
true
false

//❌ 프로그램이 허용하지 않음 문자(정의되지 않은)
//    truthy
//    falsy
//    yes
//    ok
//    no
//-----------------------------------------




// 터미널 값 출력

// 주석 한 줄(single line comment)

/*CSS 주석
여러 줄
주석 작성(multi line comment)*/