// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const STUDENT_NAME = '백희연'
// - 나이(변수)
let studentAge = 20
// - 학생 여부(상수)
const STUDENT_STATUS = 'STUDENT'
// - 모든 정보를 한 번에 출력해보세요.

console.log('학생정보 : ', STUDENT_NAME, studentAge, STUDENT_STATUS)


// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const number1 = 40
// - 숫자2(상수)
const number2 = 30
// - 결과(변수)
const result = number1 + number2 
console.log(result)


// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const GOODS_NAME = '쿠로미 키링'
// - 가격(변수)
let goodsPrice = 12500
// - 재고 있음(변수)
let goodNumber = 140
// - 할인율(상수)
const GOODS_DISCOUNT = 20

console.log(GOODS_NAME, goodNumber, goodsPrice, GOODS_DISCOUNT)
